'Задани 1'
zd_1_1 = (1, 2, 3)
zd_1_2 = (1, 2, 3)
zd_1_3 = (1, 2, 3)
print('Задани 1')
print(f'id(zd_1_1) до изменения типа - {id(zd_1_1)}')
print(f'id(zd_1_2) до изменения типа - {id(zd_1_2)}')
print(f'id(zd_1_3) до изменения типа - {id(zd_1_3)}')
print()

'Задание 2'
zd_2_1 = {1}
zd_2_2 = {1}
print('Задание 2')
print(f'id(zd_2_1) до изменения типа - {id(zd_2_1)}')
print(f'id(zd_2_2) до изменения типа - {id(zd_2_2)}')
print()

'Задание 3'
zd_1_1 = list(zd_1_1)
zd_1_2 = list(zd_1_2)
zd_1_3 = list(zd_1_3)
print('Задани 3')
print(f'id(zd_1_1) после изменения типа - {id(zd_1_1)}')
print(f'id(zd_1_2) после изменения типа - {id(zd_1_2)}')
print(f'id(zd_1_3) после изменения типа - {id(zd_1_3)}')
zd_2_1 = int(*zd_2_1)
zd_2_2 = int(*zd_2_2)
print()
print(f'id(zd_2_1)  после изменения типа  - {id(zd_2_1)}')
print(f'id(zd_2_2)  после изменения типа  - {id(zd_2_2)}')
